/**
 * 1)  private final List<T> stack => LinkedList<T>
 *
 *
 *
 * 2) private ArrayList<T> deque => LinkedList<T>
 *
 *
 * 3)  private final List<T> queue => LinkedList
 *
 *
 * 4) В случаях когда есть обычный массив лучше перейти к динамическому из стандартной библиотеки (например ArrayList ) и использовать доступ с помощью итератора
 *
 *
 * 5) Можно попробовать использовать в каких-то случаях Map вместо массива, так как в этом случае при обращении по несуществующему ключу не будет ошибки в рантайме
 *
 *
 *
 *
 */

public class Arrays {
}
