/**
 * 4.
 * 1)16 - MIN_CAPACITY
 * // В динамическом массиве магическое число 16 заменено константой, хранящей минимальный размер массива
 *
 * 2) 0.5 - DECREASE_CAPACITY_THRESHOLD
 * // Магическое число - порог заполнения динамического массива, ниже которого размер массива сокращается, заменено константой
 *
 * 3) 1.5 - DECREASE_BUFFER_VALUE
 * // Магическое число, на которое уменьшается буфер динамического массива, заменено константой
 *
 * 4) 2 - INCREASE_BUFFER_VALUE
 * // Магическое число, на которое увеличивается буфер динамического массива, заменено константой
 *
 * 5) step - STEP
 * // Неизменяемая переменная в хеш-таблице заменена константой
 *
 * 6) filter_len - FILTER_LENGTH
 * // Неизменяемая переменная в фильтре Блюма заменена константой
 *
 * 7) 20000 - INITIAL_CAPACITY
 * // Число 20000 в конструкторе PowerSet заменено константой
 *
 * 8) 8 - OCTAL_NUMERAL_SYSTEM
 * // Магическое число заменено константой
 *
 * 9) 2.0 - API_VERSION
 * // Число заменил константой
 *
 * 10) "RUB" - RUB_TICKER
 * // Вынес тикер для российкого рубля в константу
 *
 * 11) 60_000 - CACHE_REFRESH_TIME_MS
 * // Время через которго кэш будет сброшен в МС
 *
 * 12) 401 - UNAUTHORIZED_STATUS_CODE
 * // СТатус код 401 заменен на константу
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */


public class Constants_1 {
}
