/**
 * Так как пишу на Java, есть только поля классов как таковых глобальных переменных нет, разве что статические переменные
 * Обычно в своей работе стараюсь всегда использовать самый строгий модификатор доступа насколько это возможно, поэтому в своих проектах не нахожу примеров
 * А вот в курсе по алгоритмам практически везде можно сделать поля Java класса private так как таким образом делаем сокрытие деталей реализации.
 * На своей памяти пару раз было, когда например инициализировал переменную до цикла, хотя можно было уменьшийть скоуп создав ее уже в блоке цикла
 * В курсе по алгоритмам можно было вынести часть кода в отдельные private методы, оставив API публичным
 *
 */
public class Variables_Lifetime_1 {
}
